# Groupby

In [1]:
import numpy as np
import pandas as pd

In [2]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [6]:
df.groupby('Company')

In [7]:
byComp = df.groupby('Company')

In [8]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [9]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [10]:
byComp.sum().loc['GOOG']

Sales    320
Name: GOOG, dtype: int64

In [11]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [12]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2